cad/cfd/cases/stirrer_A_beaker_100mL/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  DPSim CFD-PBE — initial U field for Stirrer A
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    vessel_wall
    {
        type            noSlip;
    }
    impeller_wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
