cad/cfd/cases/stirrer_A_beaker_100mL/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
  DPSim CFD-PBE — initial omega field (specific dissipation rate, k-ω SST)
  omega_init = sqrt(k) / (Cmu^(1/4) · L_t) with L_t = 0.07·D = 0.004 m,
  Cmu = 0.09 → omega_init ≈ 95 1/s.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 95;

boundaryField
{
    vessel_wall
    {
        type            omegaWallFunction;
        value           uniform 95;
    }
    impeller_wall
    {
        type            omegaWallFunction;
        value           uniform 95;
    }
}

// ************************************************************************* //
