cad/cfd/cases/stirrer_A_beaker_100mL/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  DPSim CFD-PBE — transportProperties for Stirrer A.
  Continuous-phase fluid: paraffin oil at emulsification temperature
  (rho = 860 kg/m³, mu = 0.05 Pa·s → nu ≈ 5.81e-5 m²/s).
  Update for your specific oil + temperature; nu = mu / rho.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0]    5.81e-5;

// ************************************************************************* //
