cad/cfd/cases/stirrer_A_beaker_100mL/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  DPSim CFD-PBE — turbulenceProperties for Stirrer A.
  k-ω SST RANS (per cad/cfd/README.md §"Turbulence").
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
