cad/cfd/cases/stirrer_A_beaker_100mL/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  DPSim CFD-PBE — parallel decomposition for Stirrer A
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  8;

method              scotch;          // graph-partitioning, no manual setup

distributed         no;
roots               ();

// ************************************************************************* //
