cad/cfd/cases/stirrer_A_beaker_100mL/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  DPSim CFD-PBE — fvSolution for Stirrer A
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p|pFinal"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;          // 0 in pFinal (set below)
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega)Final"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-7;
        relTol          0;
    }

    "(U|k|omega)"
    {
        $UFinal;
        relTol          0.1;
    }
}

PIMPLE
{
    correctPhi              true;
    nOuterCorrectors        2;          // PIMPLE outer loops per timestep
    nCorrectors             2;          // PISO inner loops
    nNonOrthogonalCorrectors 1;
    momentumPredictor       true;

    residualControl
    {
        U   { tolerance 1e-5; relTol 0; }
        p   { tolerance 1e-4; relTol 0; }
    }
}

relaxationFactors
{
    fields
    {
        p           0.3;
    }
    equations
    {
        U           0.7;
        k           0.7;
        omega       0.7;
    }
}

// ************************************************************************* //
